# Игра "Эрудит"
# Нужно написать программу scrabble, которая помогает считать кол-во очков (points), полученное за слово (word)
# По одному очку вы получите за буквы а, в, е=ё, и, н, о, р, с, т.
# Два очка стоит д, к, л, м, п, у.
# Три балла получают за б, г, ь, а также я.
# Четыре балла стоят буквы й, ы.
# 5 очков засчитывается за ж, з, х, ц, ч.
# 6 и 7 очков не предусмотрено.
# Восемь можно получить за букву ф, ш, э, ю.
# 10 баллов стоит буква щ,
# а 15 - ъ
# Например (Ввод --> Вывод):
# курс --> 6 (к=2, у=2, р=1, с=1)


def scrabble(word):
    """
        Функция подсчитывает количество баллов за буквы кириллицы в слове, каждая буква стоит
        определенное количество баллов
        :param word: принимаем на вход слово (строку)
        :return: возвращаем кол-во баллов за слово
        """
    # Задаем соответствие строкам и баллам в словаре (не вырезал запятые и пробелы для наглядности)
    chars_score = {'а, в, е, ё, и, н, о, р, с, т': 1,
                   'д, к, л, м, п, у': 2,
                   'б, г, ь, я': 3,
                   'й, ы': 4,
                   'ж, з, х, ц, ч': 5,
                   'ф, ш, э, ю': 8,
                   'щ': 10,
                   'ъ': 15
                   }
    points = 0
    # Для каждой буквы в слове проверяем совпадение с ключом в словаре
    for char in word:
        for key in chars_score:
            if char in key:
                # Если нашли совпадение, увеличиваем баллы на значение ключа в кот. нашли букву
                points += chars_score[key]
    return points

# Ниже НИЧЕГО НЕ НАДО ИЗМЕНЯТЬ


data = ["курс", 'авеинорстё', 'дклмпеу', 'бгья', 'йы', 'жзхцч', 'фшэю', 'щъ', "карабасбарабас", "околоводопроводного",
        "еженедельное", 'эхоэнцефалограф', 'человеконенавистничество', 'делопроизводительница']

test_data = [6, 10, 13, 12, 8, 25, 32, 25, 21, 26, 20, 54, 34, 36]

for i, d in enumerate(data):
    assert scrabble(d) == test_data[i], f'С набором {d} есть ошибка, не проходит проверку'
    print(f'Тестовый набор {d} прошёл проверку')
print('Всё ок')
